DataProcessors/ИнтеграцияZoom.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИнтеграцияZoom</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСервиса</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиВидеоконференций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияТокена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ИнтеграцияZoom/Ext/ObjectModule.bsl
//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем Соединение; // HTTPСоединение

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Интерфейс

// Параметры:
//  Код - Строка
// 
// Возвращаемое значение:
//  См. ВидеоконференцииСлужебный.НовыеРеквизитыУчетнойЗаписи
Функция Подключить(Код) Экспорт
	
	КодАвторизации = Код;
	
	Результат = Токены();
	
	Если ЗначениеЗаполнено(Результат.ТокенДоступа) Тогда
		Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
			ИдентификаторПользователя = ИдентификаторПользователяУчетнойЗаписи();
			
			УчетнаяЗаписьПоИдентификатору =
				ВидеоконференцииСлужебный.УчетнаяЗаписьПоИдентификатору(Сервис, ИдентификаторПользователя);
			
			Если ЗначениеЗаполнено(УчетнаяЗаписьПоИдентификатору) Тогда
				УчетнаяЗапись = УчетнаяЗаписьПоИдентификатору;
				Результат.Предупреждение =
					СтрШаблон(НСтр("ru = 'Учетная запись %1 уже подключена'"), ИдентификаторПользователя);
			Иначе
				УчетнаяЗапись = Справочники.УчетныеЗаписиВидеоконференций.СоздатьУчетнуюЗапись(
					Сервис, СтрШаблон("%1 (%2)", ДанныеСервиса().Представление, ИдентификаторПользователя));
			КонецЕсли;
		КонецЕсли;
		
		СохранитьНастройкиАвторизации(Результат);
	Иначе
		Результат = ВидеоконференцииСлужебный.НовыеРеквизитыУчетнойЗаписи();
	КонецЕсли;
	
	Результат.Сервис = Сервис;
	Результат.УчетнаяЗапись = УчетнаяЗапись;
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  См. ВидеоконференцииСлужебный.НовыеДанныеОДоступностиСервиса
Функция ДанныеОДоступностиСервиса() Экспорт
	
	ДанныеОДоступности = ВидеоконференцииСлужебный.НовыеДанныеОДоступностиСервиса();
	
	ДанныеОДоступности.Сервис = Сервис;
	ДанныеОДоступности.УчетнаяЗапись = УчетнаяЗапись;
	ДанныеОДоступности.Подключено = ЗначениеЗаполнено(ИдентификаторПользователяУчетнойЗаписи());
	
	Возврат ДанныеОДоступности;
	
КонецФункции

// Параметры:
//  НастройкиВидеоконференции - См. ВидеоконференцииСлужебный.НовыеНастройкиВидеоконференции
// 
// Возвращаемое значение:
//  См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
Функция СоздатьВидеоконференцию(НастройкиВидеоконференции) Экспорт
	
	Результат = ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции();
	
	УстановитьСоединение();
	
	Запрос = НовыйHTTPЗапрос("v2/users/me/meetings");
	УстановитьТелоЗапроса(Запрос, ПараметрыВидеоконференции(НастройкиВидеоконференции));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 201 Тогда
		ДанныеВидеоконференции = ПрочитатьОтветСозданияВидеоконференции(РезультатЗапроса);
		
		Результат.Состояние = ВидеоконференцииКлиентСервер.СостояниеВидеоконференции().Создана;
		Результат.Ссылка = ДанныеВидеоконференции.join_url;
		Результат.СсылкаКандидата = ДанныеВидеоконференции.join_url;
		Результат.СсылкаОрганизатора = ДанныеВидеоконференции.start_url;
		Результат.Идентификатор = ДанныеВидеоконференции.id;
		Результат.Данные = ДанныеВидеоконференции;
		Результат.Описание = НСтр("ru = 'Видеоконференция запланирована'");
	Иначе
		ЗаписатьОшибкуВЖурналРегистрации(РезультатЗапроса);
		ВызватьИсключение ВидеоконференцииСлужебный.ТекстИсключения(
			НСтр("ru = 'Не удалось создать видеоконференцию.'"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  НастройкиВидеоконференции - См. ВидеоконференцииСлужебный.НовыеНастройкиВидеоконференции
// 
// Возвращаемое значение:
//  См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
Функция ОбновитьВидеоконференцию(НастройкиВидеоконференции) Экспорт
	
	Результат = ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции();
	
	УстановитьСоединение();
	
	Запрос = НовыйHTTPЗапрос(
		СтрШаблон("v2/meetings/%1", ИдентификаторВидеоконференции(НастройкиВидеоконференции.Идентификатор)));
	УстановитьТелоЗапроса(Запрос, ПараметрыВидеоконференции(НастройкиВидеоконференции));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Изменить, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 204 Тогда
		Результат = ДанныеВидеоконференции(НастройкиВидеоконференции.Идентификатор);
		Результат.Состояние = ВидеоконференцииКлиентСервер.СостояниеВидеоконференции().Обновлена;
	Иначе
		ЗаписатьОшибкуВЖурналРегистрации(РезультатЗапроса);
		ВызватьИсключение ВидеоконференцииСлужебный.ТекстИсключения(
			НСтр("ru = 'Не удалось обновить видеоконференцию.'"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
Функция ДанныеВидеоконференции(Идентификатор) Экспорт
	
	Результат = ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции();
	
	УстановитьСоединение();
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("v2/meetings/%1", ИдентификаторВидеоконференции(Идентификатор)));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		ДанныеВидеоконференции = ПрочитатьОтветДанныеВидеоконференции(РезультатЗапроса);
		
		Результат.Состояние = ВидеоконференцииКлиентСервер.СостояниеВидеоконференции().Активна;
		Результат.Ссылка = ДанныеВидеоконференции.join_url;
		Результат.СсылкаКандидата = ДанныеВидеоконференции.join_url;
		Результат.СсылкаОрганизатора = ДанныеВидеоконференции.start_url;
		Результат.Идентификатор = ДанныеВидеоконференции.id;
		Результат.Данные = ДанныеВидеоконференции;
		Результат.Описание = НСтр("ru = 'Видеоконференция запланирована'");
	Иначе
		ЗаписатьОшибкуВЖурналРегистрации(РезультатЗапроса);
		ВызватьИсключение ВидеоконференцииСлужебный.ТекстИсключения(
			НСтр("ru = 'Не удалось получить данные о видеоконференции.'"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
Функция УдалитьВидеоконференцию(Идентификатор) Экспорт

	Результат = ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции();
	
	УстановитьСоединение();
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("v2/meetings/%1", ИдентификаторВидеоконференции(Идентификатор)));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Удалить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 204 Тогда
		ЗаписатьОшибкуВЖурналРегистрации(РезультатЗапроса);
	КонецЕсли;
	
	Результат.Состояние = ВидеоконференцииКлиентСервер.СостояниеВидеоконференции().Отменена;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСоединение()
	
	Если Не ЗначениеЗаполнено(ТокенДоступа) Тогда
		Инициализировать();
	ИначеЕсли Не ТокенДействителен() Тогда
		ТокенАктивен();
	КонецЕсли;
	
	Если Соединение = Неопределено Тогда
		Соединение = ВидеоконференцииСлужебный.НовоеHTTPСоединение(АдресСервера());
	КонецЕсли;
	
КонецПроцедуры

Процедура Инициализировать()
	
	РеквизитыУчетнойЗаписи = ВидеоконференцииСлужебный.РеквизитыУчетнойЗаписи(УчетнаяЗапись);
	
	Если РеквизитыУчетнойЗаписи = Неопределено Или Не ЗначениеЗаполнено(РеквизитыУчетнойЗаписи.ТокенДоступа) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не настроена интеграция с %1.'"), ДанныеСервиса().Представление);
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыУчетнойЗаписи);
	
	ТокенАктивен();
	
КонецПроцедуры

Функция ТокенАктивен()
	
	ТокенАктивен = Ложь;
	
	Если ТокенДействителен() Тогда
		ТокенАктивен = ДанныеОДоступностиСервиса().Подключено;
	КонецЕсли;
	
	Если Не ТокенАктивен И ЗначениеЗаполнено(ТокенОбновления) Тогда
		РезультатОбновления = ОбновитьТокены();
		ТокенАктивен = ЗначениеЗаполнено(РезультатОбновления.ТокенДоступа);
	КонецЕсли;
	
	Возврат ТокенАктивен;
	
КонецФункции

Функция ТокенДействителен()
	
	Возврат ДатаОкончанияДействияТокена > ТекущаяДатаСеанса();
	
КонецФункции

Функция Токены(Обновление = Ложь)
	
	Результат = ВидеоконференцииСлужебный.НовыеРеквизитыУчетнойЗаписи();
	
	ИдентификаторПриложения = ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляZoom();
	Структура_token_uri = ОбщегоНазначенияКлиентСервер.СтруктураURI(ИдентификаторПриложения.token_uri);
	АдресСервера = Структура_token_uri.Хост;
	Ресурс = Структура_token_uri.ПутьНаСервере;
	
	Если Обновление Тогда
		СтрокаЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"refresh_token=%1&grant_type=refresh_token",
					ТокенОбновления);
	Иначе
		СтрокаЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"code=%1&grant_type=authorization_code&redirect_uri=%2",
					КодАвторизации,
					ИдентификаторПриложения.redirect_uri); 
	КонецЕсли;
	
	СоединениеАутентификации = ВидеоконференцииСлужебный.НовоеHTTPСоединение(АдресСервера, Истина);
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("User-Agent", ЗарплатаКадры.ИмяКлиентскогоПриложения());
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Заголовки.Вставить("Authorization", ИдентификаторПриложения.Authorization);
	
	Запрос = Новый HTTPЗапрос(Ресурс, Заголовки);
	Запрос.УстановитьТелоИзСтроки(СтрокаЗапроса);
	
	РезультатЗапроса = ВидеоконференцииСлужебный.ВыполнитьHTTPЗапрос(
		СоединениеАутентификации, МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		Токены = ПрочитатьОтветТокены(РезультатЗапроса);
		
		Результат.ТокенДоступа = Токены.access_token;
		Результат.ТокенОбновления = Токены.refresh_token;
		Результат.ДатаОкончанияДействияТокена = ТекущаяДатаСеанса() + Число(Токены.expires_in);
		
		ТокенДоступа = Результат.ТокенДоступа;
		ТокенОбновления = Результат.ТокенОбновления;
		ДатаОкончанияДействияТокена = Результат.ДатаОкончанияДействияТокена;
	Иначе
		ЗаписатьОшибкуВЖурналРегистрации(РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИнформацияОПользователе()
	
	Результат = Новый Структура();
	Результат.Вставить("ИмяПользователя", "");
	
	УстановитьСоединение();
	
	Если ЗначениеЗаполнено(ТокенДоступа) Тогда
		Запрос = НовыйHTTPЗапрос("v2/users/me");
		
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
		
		Если РезультатЗапроса.КодСостояния = 200 Тогда
			ИнформацияОПользователе = ПрочитатьОтветИнформацияОПользователе(РезультатЗапроса);
			Результат.ИмяПользователя = ИнформацияОПользователе.email;
		Иначе
			ЗаписатьОшибкуВЖурналРегистрации(РезультатЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторПользователяУчетнойЗаписи()
	
	Возврат ИнформацияОПользователе().ИмяПользователя;
	
КонецФункции

Функция ОбновитьТокены()
	
	Результат = Токены(Истина);
	
	Если ЗначениеЗаполнено(Результат.ТокенДоступа) Тогда
		СохранитьНастройкиАвторизации(Результат);
	Иначе
		Результат = ВидеоконференцииСлужебный.НовыеРеквизитыУчетнойЗаписи();
	КонецЕсли;
	
	Результат.Сервис = Сервис;
	Результат.УчетнаяЗапись = УчетнаяЗапись;
	
	Возврат Результат;
	
КонецФункции

Процедура СохранитьНастройкиАвторизации(ДанныеУчетнойЗаписи)
	
	ИнформацияОПользователе = ИнформацияОПользователе();
	
	ДанныеУчетнойЗаписи.УчетнаяЗапись = УчетнаяЗапись;
	ДанныеУчетнойЗаписи.Сервис = Сервис;
	ДанныеУчетнойЗаписи.ИмяПользователя = ИнформацияОПользователе.ИмяПользователя;
	ДанныеУчетнойЗаписи.ИдентификаторПользователя = ИнформацияОПользователе.ИмяПользователя;
	
	ВидеоконференцииСлужебный.СохранитьНастройкиАвторизации(ДанныеУчетнойЗаписи);
	
КонецПроцедуры

// Возвращаемое значение:
//  См. ВидеоконференцииСлужебный.НовыеДанныеСервиса
Функция ДанныеСервиса()
	
	Возврат ДанныеСервиса;
	
КонецФункции

Функция АдресСервера()

	Возврат ДанныеСервиса().АдресЗапроса;

КонецФункции

Функция МетодыЗапросов()
	
	Возврат ВидеоконференцииСлужебный.МетодыЗапросов();
	
КонецФункции

Функция ПараметрыВидеоконференции(НастройкиВидеоконференции)
	
	ОтправляемыеДанные = Новый Структура();
	ОтправляемыеДанные.Вставить("duration", 			НастройкиВидеоконференции.Продолжительность);
	
	Настройки = Новый Структура();
	Настройки.Вставить("alternative_hosts", 			"");
	Настройки.Вставить("approval_type", 				2);
	Настройки.Вставить("host_video", 					Истина);
	Настройки.Вставить("jbh_time", 						0);
	Настройки.Вставить("participant_video", 			Истина);
	Настройки.Вставить("private_meeting", 				Ложь);
	Настройки.Вставить("show_share_button", 			Ложь);
	Настройки.Вставить("waiting_room", 					Истина);
	
	ОтправляемыеДанные.Вставить("settings", 			Настройки);
	ОтправляемыеДанные.Вставить("topic", 				НастройкиВидеоконференции.Тема);
	ОтправляемыеДанные.Вставить("type", 				2);
	ОтправляемыеДанные.Вставить("start_time",
		Формат(УниверсальноеВремя(НастройкиВидеоконференции.Начало), "ДФ=yyyy-MM-ddTHH:mm:ssZ"));
	
	Возврат ОтправляемыеДанные;
	
КонецФункции

Функция НовыйHTTPЗапрос(АдресРесурса)
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("User-Agent", ЗарплатаКадры.ИмяКлиентскогоПриложения());
	Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1", ТокенДоступа));
	
	Запрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	
	Возврат Запрос;
	
КонецФункции

Функция ВыполнитьHTTPЗапрос(Метод, Запрос)
	
	Возврат ВидеоконференцииСлужебный.ВыполнитьHTTPЗапрос(Соединение, Метод, Запрос);
	
КонецФункции

// Параметры:
//  РезультатЗапроса - См. ВидеоконференцииСлужебный.НовыйРезультатЗапроса
// 
// Возвращаемое значение:
//  Структура:
// * access_token - Строка
// * refresh_token - Строка
// * expires_in - Строка
Функция ПрочитатьОтветТокены(РезультатЗапроса)
	
	ВидеоконференцииСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Ложь);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - См. ВидеоконференцииСлужебный.НовыйРезультатЗапроса
// 
// Возвращаемое значение:
//  Структура:
// * join_url - Строка
// * start_url - Строка
// * id - Строка
// * created_at - Строка
Функция ПрочитатьОтветСозданияВидеоконференции(РезультатЗапроса)
	
	ВидеоконференцииСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Ложь);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - См. ВидеоконференцииСлужебный.НовыйРезультатЗапроса
// 
// Возвращаемое значение:
//  Структура:
// * join_url - Строка
// * start_url - Строка
// * id - Строка
// * created_at - Строка
Функция ПрочитатьОтветДанныеВидеоконференции(РезультатЗапроса)
	
	ВидеоконференцииСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Ложь);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - См. ВидеоконференцииСлужебный.НовыйРезультатЗапроса
// 
// Возвращаемое значение:
//  Структура:
// * email - Строка
Функция ПрочитатьОтветИнформацияОПользователе(РезультатЗапроса)
	
	ВидеоконференцииСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Ложь);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - См. ВидеоконференцииСлужебный.НовыйРезультатЗапроса
// 
// Возвращаемое значение:
//  Структура:
// * error - Строка
// * reason - Строка
Функция ПрочитатьОтветСОшибкой(РезультатЗапроса)
	
	ВидеоконференцииСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Ложь);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  Запрос - HTTPЗапрос
//  Тело - Структура
Процедура УстановитьТелоЗапроса(Запрос, Тело)
	
	Запрос.УстановитьТелоИзСтроки(ВидеоконференцииСлужебный.ЗаписьJSON(Тело));
	
КонецПроцедуры

Функция ИдентификаторВидеоконференции(Идентификатор)

	ИдентификаторВидеоконференции = СокрЛП(Идентификатор);
	ИдентификаторВидеоконференции = СтрЗаменить(ИдентификаторВидеоконференции, Символы.НПП, "");
	ИдентификаторВидеоконференции = СтрЗаменить(ИдентификаторВидеоконференции, " ", "");
	
	Возврат ИдентификаторВидеоконференции;

КонецФункции

Процедура ЗаписатьОшибкуВЖурналРегистрации(РезультатЗапроса)
	
	ТелоОтвета = ПрочитатьОтветСОшибкой(РезультатЗапроса);
	КодСостояния = РезультатЗапроса.КодСостояния;
	
	ОписаниеОшибки = СтрШаблон(
		НСтр("ru = 'Ошибка при выполнении запроса к %1:
					|Код состояния: %2
					|Тип ошибки: %3
					|Причина: %4
					|Запрос: %5
					|Тело запроса: %6
					|Текст ответа: %7'"),
		РезультатЗапроса.Сервис,
		РезультатЗапроса.КодСостояния,
		?(КодСостояния = 400, ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТелоОтвета, "error", ""), ""),
		?(КодСостояния = 400, ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТелоОтвета, "reason", ""), ""),
		РезультатЗапроса.АдресРесурса,
		РезультатЗапроса.ТекстЗапроса,
		РезультатЗапроса.Ответ);

	ЗаписьЖурналаРегистрации(
		СтрШаблон(НСтр("ru = 'Выполнение запроса к %1'", ОбщегоНазначения.КодОсновногоЯзыка()), РезультатЗапроса.Сервис),
		УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
